In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('Datasets/output2.xlsx')
df.head()

,pclass,survived,sex,age,sibsp,parch,ticket,cabin,embarked,boat,body
0,1,1,female,29.0,0,0,24160,B5,S,2,NaN
1,1,0,male,30.0,1,2,113781,C22 C26,S,NaN,135.0
2,1,0,female,25.0,1,2,113781,C22 C26,S,NaN,NaN
3,1,1,male,48.0,0,0,19952,E12,S,3,NaN
4,1,1,female,63.0,1,0,13502,D7,S,10,NaN

# I'm Alive

In [3]:
df['survived'].unique()

array([1, 0], dtype=int64)

In [4]:
df['survived'].value_counts()

0    794
1    474
Name: survived, dtype: int64

# The number of men who survived

In [5]:
men_only = df[df['sex'] == 'male']

In [6]:
men_only.shape

(821, 11)

In [7]:
survived = men_only[men_only['survived'] == 1]

In [8]:
survived.shape

(146, 11)

In [9]:
men_survived_percentage = (survived.shape[0] / men_only.shape[0]) * 100

In [10]:
print('Percentage of men who survived: {:.2f}%'.format(men_survived_percentage))

Percentage of men who survived: 17.78%

# Pretty Output

In [11]:
def Calc(s = 1):
    for gen in df['sex'].unique():
        gen_df = df[df['sex'] == gen]
        gen_survived = gen_df[gen_df['survived'] == s]
        gen_survived_percentage = (gen_survived.shape[0] / gen_df.shape[0]) * 100
        msg = 'survived'
        if s == 0:
            msg = 'non-survived'
        print('Percentage of {} who {}: {:.2f}%'.format(gen, msg, gen_survived_percentage))

In [12]:
Calc(s = 1)

Percentage of female who survived: 73.38%
Percentage of male who survived: 17.78%

In [13]:
Calc(s = 0)

Percentage of female who non-survived: 26.62%
Percentage of male who non-survived: 82.22%

# PClass

In [14]:
def PClass():
    for x in df['pclass'].unique():
        x_df = df[df['pclass'] == x]
        sur = x_df[x_df['survived'] == 1]
        x_survived_percentage = (sur.shape[0] / x_df.shape[0]) * 100
        print('======')
        print('Class: ', x)
        print('Count: ', x_df.shape[0])
        print('Survived: ', '%.2f' % x_survived_percentage, '%')
PClass()

======
Class:  1
Count:  321
Survived:  61.99 %
======
Class:  2
Count:  264
Survived:  40.15 %
======
Class:  3
Count:  683
Survived:  24.74 %

# Convert `Ages` to `Categorical`

In [15]:
df2 = df.copy()

In [16]:
def convert_age_to_categorical(age):
    if age < 4:
        return 0 # baby
    elif age < 10:
        return 1 # kid or child
    elif age < 21:
        return 2 # teen
    elif age < 33:
        return 3 # young adult
    elif age < 50:
        return 4 # adult
    return 5 # elder
age_cats = {0:'baby', 1:'child', 2:'teen', 3:'young adult', 4:'adult', 5:'elder'}
df2['age_phase'] = df2['age'].apply(convert_age_to_categorical)
df2['age_phase'] = df2['age_phase'].map(age_cats)

In [17]:
df2.head()

,pclass,survived,sex,age,sibsp,parch,ticket,cabin,embarked,boat,body,age_phase
0,1,1,female,29.0,0,0,24160,B5,S,2,NaN,young adult
1,1,0,male,30.0,1,2,113781,C22 C26,S,NaN,135.0,young adult
2,1,0,female,25.0,1,2,113781,C22 C26,S,NaN,NaN,young adult
3,1,1,male,48.0,0,0,19952,E12,S,3,NaN,adult
4,1,1,female,63.0,1,0,13502,D7,S,10,NaN,elder

In [18]:
df2.to_excel("Datasets/output3.xlsx", index = False)

# Bye